imdacrocker/esp32_gopro_canbus_controller_v2/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y

# Pin NimBLE host and BT controller to core 1 (§4.1)
CONFIG_BT_NIMBLE_PINNED_TO_CORE_1=y
CONFIG_BT_CTRL_PINNED_TO_CORE_1=y

# Connection capacity: 4 cameras + headroom
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=5

# Bonding storage in NVS
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# ATT MTU — request the maximum so GoPro long responses
# (GetHardwareInfoRsp ~88 bytes) do not fragment
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517

# Pin WiFi task to core 0, opposite NimBLE (§4.1)
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0=y

# DHCP server
CONFIG_LWIP_DHCPS=y
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=8

# Web UI server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# HTTPS client (open_gopro_http)
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_TLS_CLIENT=y
CONFIG_MBEDTLS_HAVE_TIME=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

#CONFIG_LITTLEFS_PARTITION_LABEL="storage" 

# Pin esp_timer task to core 0 alongside WiFi (§4.1)
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096

CONFIG_LOG_DEFAULT_LEVEL_INFO=y       # production-quiet at boot
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y    # ceiling for runtime override (§22.6)
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
CONFIG_LOG_COLORS=y                   # ANSI colors over USB serial

CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y